Full output.  The user_data for the ibm_is_instance changed forcing new instance and new floating_ip:

```
➜  vpc_tf git:(master) ✗ tfa
ibm_resource_instance.logdna_instance: Refreshing state... [id=crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254::]
ibm_is_vpc.location: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217]
ibm_is_security_group_rule.inbound_all_todo: Refreshing state... [id=r006-f1c8614a-850b-4939-8afe-cef7aa192b41.r006-0bf18e5f-0f0f-4682-94d0-c4e9f4994564]
ibm_is_security_group_rule.inbound_myip: Refreshing state... [id=r006-f1c8614a-850b-4939-8afe-cef7aa192b41.r006-c93c434f-8d9d-4bfd-b55e-26def63af528]
ibm_is_vpc_address_prefix.locations["1"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-7f8053e3-d47b-41f2-be5d-faaa43566fe6]
ibm_is_vpc_address_prefix.locations["2"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-c8aecaa3-e546-4e6f-89d6-305c43c3b837]
ibm_is_vpc_address_prefix.locations["0"]: Refreshing state... [id=r006-ac0c46ee-3b1f-431e-b691-fef004bb5217/r006-e0d33f49-46d9-424b-9814-0a746934e876]
ibm_is_subnet.app["0"]: Refreshing state... [id=0717-3c3074d3-635e-41a3-8ffe-c7a98ee50c9a]
ibm_is_subnet.data["1"]: Refreshing state... [id=0727-a12ef5a8-12a6-4d5b-b6d9-4d2b4e3d40ef]
ibm_is_subnet.data["0"]: Refreshing state... [id=0717-76b176ee-22d0-4a7f-ac24-7c52ebcc69f9]
ibm_is_subnet.app["1"]: Refreshing state... [id=0727-effb9494-c588-4214-814e-b664810dd5c7]
ibm_is_instance.app["0"]: Refreshing state... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3]
ibm_is_instance.app["1"]: Refreshing state... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202]
ibm_is_floating_ip.location["1"]: Refreshing state... [id=r006-97728f0b-262e-4e47-94b6-3ba6cca76474]
ibm_is_floating_ip.location["0"]: Refreshing state... [id=r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # ibm_resource_instance.logdna_instance has been changed
  ~ resource "ibm_resource_instance" "logdna_instance" {
        id                      = "crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254::"
        name                    = "vpc3tier"
      ~ tags                    = [
          - "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          + "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
        # (31 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ibm_is_floating_ip.location["0"] will be updated in-place
  ~ resource "ibm_is_floating_ip" "location" {
        id                      = "r006-eca4c2b5-0e28-4e23-b692-83f0f60b0161"
        name                    = "vpc3tier-app-0"
        tags                    = [
            "basename:vpc3tier",
            "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
        ]
      ~ target                  = "0717-cd40048c-9cb5-4d2d-9ad8-bc350c9cba2f" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # ibm_is_floating_ip.location["1"] will be updated in-place
  ~ resource "ibm_is_floating_ip" "location" {
        id                      = "r006-97728f0b-262e-4e47-94b6-3ba6cca76474"
        name                    = "vpc3tier-app-1"
        tags                    = [
            "basename:vpc3tier",
            "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
        ]
      ~ target                  = "0727-6edaedf5-388c-4284-bbd1-8e0f64f166a8" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # ibm_is_instance.app["0"] must be replaced
-/+ resource "ibm_is_instance" "app" {
      ~ disks                   = [] -> (known after apply)
      ~ gpu                     = [] -> (known after apply)
      ~ id                      = "0717_b4832d13-777a-4404-b98d-d8cee07ce7d3" -> (known after apply)
      ~ memory                  = 4 -> (known after apply)
        name                    = "vpc3tier-app-0"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/compute/vs" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-1:a/713c783d9a507a53135fe6793c37cc74::instance:0717_b4832d13-777a-4404-b98d-d8cee07ce7d3" -> (known after apply)
      ~ resource_group_name     = "default" -> (known after apply)
      ~ resource_name           = "vpc3tier-app-0" -> (known after apply)
      ~ resource_status         = "running" -> (known after apply)
      ~ status                  = "running" -> (known after apply)
      ~ status_reasons          = [] -> (known after apply)
      ~ tags                    = [
          + "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          - "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
      ~ user_data               = <<-EOT # forces replacement
            #!/bin/bash

            # parameters via substitution done in terraform
            NAME=vpc3tier-app-0

            apt-get update
            apt-get install -y nginx ntpdate ntp postgresql-client-common postgresql-client
            ifconfig ens3 mtu 1200;# see https://jiracloud.swg.usma.ibm.com:8443/browse/VPN-365
            echo $NAME > /var/www/html/name
            curl localhost/name
            # ibmcloud
            curl -fsSL https://clis.cloud.ibm.com/install/linux | sh
          +
          +
          + # new
          + apt install python3-pip -y
          +
          + root@vpc3tier-app-1:~# pip3 freeze
          + asgiref==3.4.1
          + asn1crypto==0.24.0
          + attrs==17.4.0
          + Automat==0.6.0
          + blinker==1.4
          + certifi==2018.1.18
          + chardet==3.0.4
          + click==8.0.1
          + cloud-init==18.4
          + colorama==0.3.7
          + command-not-found==0.3
          + configobj==5.0.6
          + constantly==15.1.0
          + cryptography==2.1.4
          + dataclasses==0.8
          + distro-info===0.18ubuntu0.18.04.1
          + fastapi==0.68.1
          + h11==0.12.0
          + httplib2==0.9.2
          + httptools==0.2.0
          + hyperlink==17.3.1
          + idna==2.6
          + importlib-metadata==4.8.1
          + incremental==16.10.1
          + Jinja2==2.10
          + jsonpatch==1.16
          + jsonpointer==1.10
          + jsonschema==2.6.0
          + keyring==10.6.0
          + keyrings.alt==3.0
          + language-selector==0.1
          + MarkupSafe==1.0
          + netifaces==0.10.4
          + oauthlib==2.0.6
          + PAM==0.4.2
          + pyasn1==0.4.2
          + pyasn1-modules==0.2.1
          + pycrypto==2.6.1
          + pydantic==1.8.2
          + pygobject==3.26.1
          + PyJWT==1.5.3
          + pyOpenSSL==17.5.0
          + pyserial==3.4
          + python-apt==1.6.5+ubuntu0.5
          + python-debian==0.1.32
          + python-dotenv==0.19.0
          + pyxdg==0.25
          + PyYAML==5.4.1
          + requests==2.18.4
          + requests-unixsocket==0.1.5
          + SecretStorage==2.3.1
          + service-identity==16.0.0
          + six==1.11.0
          + ssh-import-id==5.7
          + starlette==0.14.2
          + systemd-python==234
          + Twisted==17.9.0
          + typing-extensions==3.10.0.2
          + ufw==0.35
          + unattended-upgrades==0.1
          + urllib3==1.22
          + uvicorn==0.15.0
          + uvloop==0.14.0
          + watchgod==0.7
          + websockets==9.1
          + zipp==3.5.0
          + zope.interface==4.3.2
          +
          + uvicorn --host 0.0.0.0 main:app --reload
          +
          +
          + echo "deb https://repo.logdna.com stable main" | sudo tee /etc/apt/sources.list.d/logdna.list
          + wget -O- https://repo.logdna.com/logdna.gpg | sudo apt-key add -
          + sudo apt-get update
          + sudo apt-get install logdna-agent < "/dev/null"
          + sudo logdna-agent -k 8600482a753138be8b856845ada81eb7
          + sudo logdna-agent -s LOGDNA_APIHOST=api.us-south.logging.cloud.ibm.com
          + sudo logdna-agent -s LOGDNA_LOGHOST=logs.us-south.logging.cloud.ibm.com
          + sudo logdna-agent -d /path/to/log/folders
          + sudo logdna-agent -t mytag,myothertag
          + sudo update-rc.d logdna-agent defaults
          + sudo /etc/init.d/logdna-agent start
          +
        EOT
      ~ vcpu                    = [
          - {
              - architecture = "amd64"
              - count        = 2
            },
        ] -> (known after apply)
      ~ volume_attachments      = [
          - {
              - id          = "0717-83aa3d97-c4df-4f2f-9fd4-1692ecb1b0b2"
              - name        = "washtub-jaws-item-glider"
              - volume_crn  = "crn:v1:bluemix:public:is:us-south-1:a/713c783d9a507a53135fe6793c37cc74::volume:r006-f0df0550-2b02-4cbf-aa83-54a1012804e9"
              - volume_id   = "r006-f0df0550-2b02-4cbf-aa83-54a1012804e9"
              - volume_name = "ought-spot-speculate-cloud"
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_volume {
          + encryption = (known after apply)
          ~ iops       = 3000 -> (known after apply)
          ~ name       = "ought-spot-speculate-cloud" -> (known after apply)
          ~ profile    = "general-purpose" -> (known after apply)
          ~ size       = 100 -> (known after apply)
          + snapshot   = (known after apply)
        }

      ~ primary_network_interface {
          ~ id                   = "0717-cd40048c-9cb5-4d2d-9ad8-bc350c9cba2f" -> (known after apply)
          ~ name                 = "hurtling-oblong-germless-glisten" -> (known after apply)
          - port_speed           = 0 -> null
          ~ primary_ipv4_address = "10.0.0.4" -> (known after apply)
          ~ security_groups      = [
              - "r006-f1c8614a-850b-4939-8afe-cef7aa192b41",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # ibm_is_instance.app["1"] must be replaced
-/+ resource "ibm_is_instance" "app" {
      ~ disks                   = [] -> (known after apply)
      ~ gpu                     = [] -> (known after apply)
      ~ id                      = "0727_754c9c8b-9866-488b-b322-6c7d01d08202" -> (known after apply)
      ~ memory                  = 4 -> (known after apply)
        name                    = "vpc3tier-app-1"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/compute/vs" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-2:a/713c783d9a507a53135fe6793c37cc74::instance:0727_754c9c8b-9866-488b-b322-6c7d01d08202" -> (known after apply)
      ~ resource_group_name     = "default" -> (known after apply)
      ~ resource_name           = "vpc3tier-app-1" -> (known after apply)
      ~ resource_status         = "running" -> (known after apply)
      ~ status                  = "running" -> (known after apply)
      ~ status_reasons          = [] -> (known after apply)
      ~ tags                    = [
          + "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
          - "dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
            # (1 unchanged element hidden)
        ]
      ~ user_data               = <<-EOT # forces replacement
            #!/bin/bash

            # parameters via substitution done in terraform
            NAME=vpc3tier-app-1

            apt-get update
            apt-get install -y nginx ntpdate ntp postgresql-client-common postgresql-client
            ifconfig ens3 mtu 1200;# see https://jiracloud.swg.usma.ibm.com:8443/browse/VPN-365
            echo $NAME > /var/www/html/name
            curl localhost/name
            # ibmcloud
            curl -fsSL https://clis.cloud.ibm.com/install/linux | sh
          +
          +
          + # new
          + apt install python3-pip -y
          +
          + root@vpc3tier-app-1:~# pip3 freeze
          + asgiref==3.4.1
          + asn1crypto==0.24.0
          + attrs==17.4.0
          + Automat==0.6.0
          + blinker==1.4
          + certifi==2018.1.18
          + chardet==3.0.4
          + click==8.0.1
          + cloud-init==18.4
          + colorama==0.3.7
          + command-not-found==0.3
          + configobj==5.0.6
          + constantly==15.1.0
          + cryptography==2.1.4
          + dataclasses==0.8
          + distro-info===0.18ubuntu0.18.04.1
          + fastapi==0.68.1
          + h11==0.12.0
          + httplib2==0.9.2
          + httptools==0.2.0
          + hyperlink==17.3.1
          + idna==2.6
          + importlib-metadata==4.8.1
          + incremental==16.10.1
          + Jinja2==2.10
          + jsonpatch==1.16
          + jsonpointer==1.10
          + jsonschema==2.6.0
          + keyring==10.6.0
          + keyrings.alt==3.0
          + language-selector==0.1
          + MarkupSafe==1.0
          + netifaces==0.10.4
          + oauthlib==2.0.6
          + PAM==0.4.2
          + pyasn1==0.4.2
          + pyasn1-modules==0.2.1
          + pycrypto==2.6.1
          + pydantic==1.8.2
          + pygobject==3.26.1
          + PyJWT==1.5.3
          + pyOpenSSL==17.5.0
          + pyserial==3.4
          + python-apt==1.6.5+ubuntu0.5
          + python-debian==0.1.32
          + python-dotenv==0.19.0
          + pyxdg==0.25
          + PyYAML==5.4.1
          + requests==2.18.4
          + requests-unixsocket==0.1.5
          + SecretStorage==2.3.1
          + service-identity==16.0.0
          + six==1.11.0
          + ssh-import-id==5.7
          + starlette==0.14.2
          + systemd-python==234
          + Twisted==17.9.0
          + typing-extensions==3.10.0.2
          + ufw==0.35
          + unattended-upgrades==0.1
          + urllib3==1.22
          + uvicorn==0.15.0
          + uvloop==0.14.0
          + watchgod==0.7
          + websockets==9.1
          + zipp==3.5.0
          + zope.interface==4.3.2
          +
          + uvicorn --host 0.0.0.0 main:app --reload
          +
          +
          + echo "deb https://repo.logdna.com stable main" | sudo tee /etc/apt/sources.list.d/logdna.list
          + wget -O- https://repo.logdna.com/logdna.gpg | sudo apt-key add -
          + sudo apt-get update
          + sudo apt-get install logdna-agent < "/dev/null"
          + sudo logdna-agent -k 8600482a753138be8b856845ada81eb7
          + sudo logdna-agent -s LOGDNA_APIHOST=api.us-south.logging.cloud.ibm.com
          + sudo logdna-agent -s LOGDNA_LOGHOST=logs.us-south.logging.cloud.ibm.com
          + sudo logdna-agent -d /path/to/log/folders
          + sudo logdna-agent -t mytag,myothertag
          + sudo update-rc.d logdna-agent defaults
          + sudo /etc/init.d/logdna-agent start
          +
        EOT
      ~ vcpu                    = [
          - {
              - architecture = "amd64"
              - count        = 2
            },
        ] -> (known after apply)
      ~ volume_attachments      = [
          - {
              - id          = "0727-f983d823-80b2-4e4a-86a6-52e1197a4c4c"
              - name        = "schism-cotton-unhitched-yeah"
              - volume_crn  = "crn:v1:bluemix:public:is:us-south-2:a/713c783d9a507a53135fe6793c37cc74::volume:r006-ed421ba2-2d1d-4acc-8b35-99ad3d29d009"
              - volume_id   = "r006-ed421ba2-2d1d-4acc-8b35-99ad3d29d009"
              - volume_name = "undreamed-cordless-muzzle-glutenin"
            },
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ boot_volume {
          + encryption = (known after apply)
          ~ iops       = 3000 -> (known after apply)
          ~ name       = "undreamed-cordless-muzzle-glutenin" -> (known after apply)
          ~ profile    = "general-purpose" -> (known after apply)
          ~ size       = 100 -> (known after apply)
          + snapshot   = (known after apply)
        }

      ~ primary_network_interface {
          ~ id                   = "0727-6edaedf5-388c-4284-bbd1-8e0f64f166a8" -> (known after apply)
          ~ name                 = "semicolon-snort-pushiness-retainer" -> (known after apply)
          - port_speed           = 0 -> null
          ~ primary_ipv4_address = "10.1.0.4" -> (known after apply)
          ~ security_groups      = [
              - "r006-f1c8614a-850b-4939-8afe-cef7aa192b41",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # ibm_resource_key.logdna will be created
  + resource "ibm_resource_key" "logdna" {
      + account_id            = (known after apply)
      + created_at            = (known after apply)
      + created_by            = (known after apply)
      + credentials           = (sensitive value)
      + crn                   = (known after apply)
      + deleted_at            = (known after apply)
      + deleted_by            = (known after apply)
      + guid                  = (known after apply)
      + iam_compatible        = (known after apply)
      + id                    = (known after apply)
      + name                  = "vpc3tier"
      + resource_group_id     = (known after apply)
      + resource_instance_id  = "crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254::"
      + resource_instance_url = (known after apply)
      + role                  = "Manager"
      + source_crn            = (known after apply)
      + state                 = (known after apply)
      + status                = (known after apply)
      + tags                  = [
          + "basename:vpc3tier",
          + "dir:_Users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf",
        ]
      + updated_at            = (known after apply)
      + updated_by            = (known after apply)
      + url                   = (known after apply)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ instances = {
      ~ 0 = {
          ~ primary_ipv4_address = "10.0.0.4" -> (known after apply)
            # (2 unchanged elements hidden)
        }
      ~ 1 = {
          ~ primary_ipv4_address = "10.1.0.4" -> (known after apply)
            # (2 unchanged elements hidden)
        }
    }
ibm_is_instance.app["0"]: Destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3]
ibm_is_instance.app["1"]: Destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202]
ibm_resource_key.logdna: Creating...
ibm_resource_key.logdna: Creation complete after 4s [id=crn:v1:bluemix:public:logdna:us-south:a/713c783d9a507a53135fe6793c37cc74:e54eee2d-53ba-457c-b4b0-caf278309254:resource-key:f9e2d3f4-29ea-4812-a489-5ab369a9e9d5]
ibm_is_instance.app["1"]: Still destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202, 10s elapsed]
ibm_is_instance.app["0"]: Still destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3, 10s elapsed]
ibm_is_instance.app["1"]: Still destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202, 20s elapsed]
ibm_is_instance.app["0"]: Still destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3, 20s elapsed]
ibm_is_instance.app["0"]: Still destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3, 30s elapsed]
ibm_is_instance.app["1"]: Still destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202, 30s elapsed]
ibm_is_instance.app["1"]: Still destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202, 40s elapsed]
ibm_is_instance.app["0"]: Still destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3, 40s elapsed]
ibm_is_instance.app["0"]: Still destroying... [id=0717_b4832d13-777a-4404-b98d-d8cee07ce7d3, 50s elapsed]
ibm_is_instance.app["1"]: Still destroying... [id=0727_754c9c8b-9866-488b-b322-6c7d01d08202, 50s elapsed]
ibm_is_instance.app["1"]: Destruction complete after 51s
ibm_is_instance.app["1"]: Creating...
ibm_is_instance.app["0"]: Destruction complete after 52s
ibm_is_instance.app["0"]: Creating...
ibm_is_instance.app["1"]: Still creating... [10s elapsed]
ibm_is_instance.app["0"]: Still creating... [10s elapsed]
ibm_is_instance.app["1"]: Still creating... [20s elapsed]
ibm_is_instance.app["0"]: Still creating... [20s elapsed]
ibm_is_instance.app["1"]: Still creating... [30s elapsed]
ibm_is_instance.app["0"]: Still creating... [30s elapsed]
ibm_is_instance.app["1"]: Still creating... [40s elapsed]
ibm_is_instance.app["0"]: Still creating... [40s elapsed]
ibm_is_instance.app["1"]: Still creating... [50s elapsed]
ibm_is_instance.app["0"]: Still creating... [50s elapsed]
ibm_is_instance.app["1"]: Still creating... [1m0s elapsed]
ibm_is_instance.app["0"]: Still creating... [1m0s elapsed]
ibm_is_instance.app["0"]: Creation complete after 1m5s [id=0717_3b08198d-b1be-47c4-9886-5d9425779fc0]
ibm_is_instance.app["1"]: Still creating... [1m10s elapsed]
ibm_is_instance.app["1"]: Creation complete after 1m10s [id=0727_559a39a3-0aab-433a-8696-918f50f3c934]
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" changed the planned action from Update to DeleteThenCreate.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_group_name: was
│ known, but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_name: was known, but
│ now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .tags: planned set element
│ cty.StringVal("dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf") does not correlate with any element in actual.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_controller_url: was
│ known, but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_crn: was known, but
│ now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_status: was known,
│ but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .status: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .zone: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .address: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["1"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .id: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" changed the planned action from Update to DeleteThenCreate.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_controller_url: was
│ known, but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_group_name: was
│ known, but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_name: was known, but
│ now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .tags: planned set element
│ cty.StringVal("dir:_users_pquiring_github.ibm.com_portfolio-solutions_scenario-3tier_vpc_tf") does not correlate with any element in actual.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .zone: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .address: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .id: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_crn: was known, but
│ now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .resource_status: was known,
│ but now unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for ibm_is_floating_ip.location["0"] to include new values learned so far during apply, provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid new value for .status: was known, but now
│ unknown.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
```